mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
/****************************************************************************
 * drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * net_driver_s operations for the nRF7002 WiFi driver.
 *
 * Phase 3 additions:
 *   - txpoll: token-based TX path via nrf_wifi_fmac_start_xmit
 *   - netdev_txnotify: invokes txpoll if carrier is up
 *   - ifup/ifdown: power management via nrf_wifi_sys_fmac_set_power_save
 *   - SIOCSIWMODE: AP mode stub (CONFIG_IEEE80211_NRF7002_AP_MODE)
 *   - SIOCGIWSTATS: return RSSI from last scan result
 *
 * Reference: drivers/wireless/ieee80211/bcm43xxx/bcmf_netdev.c
 *            include/nuttx/wireless/wireless.h
 *            NCS/modules/lib/nrf_wifi/fw_if/umac_if/inc/
 *              system/fmac_api.h
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <string.h>
#include <syslog.h>
#include <stdint.h>

#include <nuttx/kmalloc.h>
#include <nuttx/signal.h>

#include <net/if.h>
#include <net/if_arp.h>
#include <sys/ioctl.h>
#include <nuttx/net/net.h>
#include <nuttx/net/netdev.h>
#include <nuttx/wireless/wireless.h>

#include "fmac_api.h"
#include "host_rpu_umac_if.h"
#include "nrf7002_driver.h"
#include "nrf7002_wpa.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Maximum time (ms) to wait for scan to complete */

/* Packet buffer size: max Ethernet frame + guard bytes */

#ifndef MAX_NETDEV_PKTSIZE
#  define MAX_NETDEV_PKTSIZE CONFIG_NET_ETH_PKTSIZE
#endif

#define NRF7002_PKTBUF_SIZE  ((MAX_NETDEV_PKTSIZE + CONFIG_NET_GUARDSIZE + 1) & ~1u)

#define NRF7002_SCAN_TIMEOUT_MS  15000

#define NRF7002_EAPOL_ETHERTYPE      0x888e
#define NRF7002_TX_NBUF_HEADROOM     100

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Static flat packet buffer used by devif_poll.
 * devif_poll uses dev->d_buf as the output buffer when it is non-NULL
 * (flat-buffer mode).  Without a pre-allocated d_buf the poll falls
 * into IOB mode which the nrf7002 TX path does not support.
 */

static uint16_t g_nrf7002_pktbuf[NRF7002_PKTBUF_SIZE / 2];

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int nrf7002_ifup(FAR struct net_driver_s *dev);
static int nrf7002_ifdown(FAR struct net_driver_s *dev);
int nrf7002_txpoll(FAR struct net_driver_s *dev);
static int nrf7002_txnotify(FAR struct net_driver_s *dev);
#ifdef CONFIG_NETDEV_IOCTL
static int nrf7002_ioctl(FAR struct net_driver_s *dev,
                          int cmd, unsigned long arg);
#endif

static bool nrf7002_is_eapol_frame(FAR const uint8_t *frame, size_t len);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static bool nrf7002_is_eapol_frame(FAR const uint8_t *frame, size_t len)
{
  uint16_t ethertype;

  if (frame == NULL || len < 14)
    {
      return false;
    }

  ethertype = ((uint16_t)frame[12] << 8) | frame[13];

  return ethertype == NRF7002_EAPOL_ETHERTYPE;
}

/****************************************************************************
 * Name: nrf7002_txpoll
 *
 * Description:
 *   Phase 3 TX path: token-based frame submission.
 *
 *   1. Try to acquire a TX token (non-blocking).  If none available, the
 *      RPU is busy — return -EAGAIN to throttle the stack.
 *   2. Copy d_buf/d_len into an nbuf via nrf_wifi_osal_nbuf_alloc.
 *   3. Submit via nrf_wifi_fmac_start_xmit.
 *      On failure, FMAC has freed the nbuf; return the token.
 *   4. Clear d_buf so the stack does not attempt a second send.
 *
 *   The TX token is local backpressure only and is returned immediately
 *   after nrf_wifi_fmac_start_xmit accepts or rejects the frame.
 *
 ****************************************************************************/

int nrf7002_txpoll(FAR struct net_driver_s *dev)
{
  FAR struct nrf7002_priv   *priv =
    (FAR struct nrf7002_priv *)dev->d_private;
  enum nrf_wifi_status       status;
  void                      *nbuf;
  int                        ret;

  /* Must have a frame to send */

  if (dev->d_buf == NULL || dev->d_len == 0)
    {
      return OK;
    }


  if (!priv->carrier_up || priv->fmac_dev_ctx == NULL)
    {
      return -ENETDOWN;
    }

  if (priv->security_type == NRF7002_SECURITY_WPA2 &&
      priv->keys_installed == 0 &&
      !nrf7002_is_eapol_frame((FAR const uint8_t *)dev->d_buf,
                              dev->d_len))
    {
      return -EAGAIN;
    }

  /* Acquire a TX token — non-blocking.
   * If the semaphore count is 0 all tokens are in-flight; bail.
   */

  ret = nxsem_trywait(&priv->tx_tokens);
  if (ret < 0)
    {
      /* No token available — backpressure the stack */

      return -EAGAIN;
    }

  /* Allocate a network buffer and copy the frame data.
   * The OSAL nbuf abstraction provides the buffer management that the
   * FMAC layer expects.
   */

  nbuf = nrf_wifi_osal_nbuf_alloc(dev->d_len + NRF7002_TX_NBUF_HEADROOM);
  if (nbuf == NULL)
    {
      syslog(LOG_WARNING, "nrf7002: txpoll: nbuf alloc failed\n");
      nxsem_post(&priv->tx_tokens);
      return -ENOMEM;
    }

  /* Use data_put to extend the tail and set len, then copy frame data */

  nrf_wifi_osal_nbuf_headroom_res(nbuf, NRF7002_TX_NBUF_HEADROOM);
  nrf_wifi_osal_nbuf_data_put(nbuf, dev->d_len);
  memcpy(nrf_wifi_osal_nbuf_data_get(nbuf), dev->d_buf, dev->d_len);

  NETDEV_TXPACKETS(dev);

  /* Submit to the FMAC layer.
   * nrf_wifi_fmac_start_xmit internally queues the frame and sends it to
   * the RPU when tokens are available in the NCS layer.
   */

  status = nrf_wifi_fmac_start_xmit(priv->fmac_dev_ctx,
                                     priv->vif_idx,
                                     nbuf);
  if (status != NRF_WIFI_STATUS_SUCCESS)
    {
      /* TX failed — most likely the NCS TX token/descriptor pool is
       * momentarily exhausted under high TX rate (TX-done not yet processed).
       * FMAC has freed the nbuf; return the local token and apply
       * backpressure with -EAGAIN so the network stack retries this frame
       * later instead of dropping it.  Rate-limit the log.
       */

      static uint32_t fail_cnt = 0;
      if ((++fail_cnt % 64) == 1)
        {
          syslog(LOG_WARNING, "nrf7002: txpoll start_xmit busy (%d) #%lu\n",
                 status, (unsigned long)fail_cnt);
        }

      /* nrf_wifi_fmac_start_xmit() frees nbuf on failure. */

      nxsem_post(&priv->tx_tokens);
      return -EAGAIN;
    }

  /* Frame ownership transferred to FMAC.
   * Return the driver-level TX token immediately — the FMAC manages its
   * own internal token pool.  The driver token is purely for local
   * backpressure (limiting concurrent start_xmit calls).
   */

  nxsem_post(&priv->tx_tokens);

