mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
  /* Reset d_len to indicate we consumed the frame.
   * Do NOT set d_buf = NULL — devif_poll manages d_buf; clearing it
   * would break the devif_poll flat-buffer mode loop.
   */

  dev->d_len = 0;

  NETDEV_TXDONE(dev);

  return OK;
}

/****************************************************************************
 * Name: nrf7002_txnotify
 *
 * Description:
 *   Callback from the network layer when a new TX frame is available.
 *   Calls txpoll directly when the carrier is up.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_txavail_work
 *
 * Description:
 *   LPWORK handler that runs the TX poll under net_lock.  Scheduled by
 *   nrf7002_txnotify.  Runs on the SAME LPWORK queue as nrf7002_rx_worker so
 *   TX poll and RX delivery serialize on one thread (single dev->d_buf owner).
 *   Kept off HPWORK so start_xmit never blocks the thread that delivers RPU
 *   responses.  net_lock matches the RX path's locking.
 *
 ****************************************************************************/

static void nrf7002_txavail_work(FAR void *arg)
{
  FAR struct nrf7002_priv *priv = (FAR struct nrf7002_priv *)arg;
  FAR struct net_driver_s *dev  = &priv->netdev;

  net_lock();

  /* Guard against reentrancy: rx_deliver_one and txpoll both run devif
   * output under net_lock on the same LPWORK thread.  If a TX poll re-enters
   * devif_poll (e.g. tcpsend_eventhandler queuing more output that loops back
   * here) the recursion blows the work-queue stack.  A simple in-progress
   * flag breaks the loop; the still-pending work item will retry later.
   */

  if (priv->tx_poll_busy)
    {
      /* Reentrant call on the same thread (recursive devif output) — bail to
       * break the recursion, but re-arm the worker (1-tick delay to avoid a
       * busy loop) so the pending TX is serviced after the current poll
       * completes instead of being dropped (which would stall the stream).
       */

      net_unlock();
      work_queue(LPWORK, &priv->tx_work, nrf7002_txavail_work, priv, 1);
      return;
    }

  priv->tx_poll_busy = true;

  /* Clear the pending flag before polling so any notification that arrives
   * during devif_poll is observed at the end and triggers a re-poll.
   */

  priv->tx_pending = false;

  if (priv->carrier_up)
    {
      devif_poll(dev, nrf7002_txpoll);
    }

  priv->tx_poll_busy = false;

  /* A txnotify arrived while we were polling — re-arm to drain it.  This
   * closes the work_queue debounce window (notifications coalesced while the
   * work item was already executing would otherwise be lost).
   */

  if (priv->tx_pending)
    {
      priv->tx_pending = false;
      work_queue(LPWORK, &priv->tx_work, nrf7002_txavail_work, priv, 0);
    }

  net_unlock();
}

/****************************************************************************
 * Name: nrf7002_txnotify
 *
 * Description:
 *   d_txavail callback.  The socket TX path (e.g. psock_tcp_send) calls this
 *   WITHOUT holding net_lock and from an arbitrary task context.  Calling
 *   devif_poll inline here would race nrf7002_rx_worker (LPWORK) over
 *   dev->d_buf and corrupt it under bidirectional load (iperf).  Defer to
 *   LPWORK so the poll runs serially with RX delivery under net_lock.
 *
 ****************************************************************************/

static int nrf7002_txnotify(FAR struct net_driver_s *dev)
{
  FAR struct nrf7002_priv *priv =
    (FAR struct nrf7002_priv *)dev->d_private;


  if (priv->carrier_up)
    {
      /* Mark a pending notification so a txnotify that lands while the worker
       * is already running (work_queue debounce window) is not lost.  Ignore
       * EBUSY from work_queue — an already-queued tx_work covers it.
       */

      priv->tx_pending = true;
      work_queue(LPWORK, &priv->tx_work, nrf7002_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Name: nrf7002_ifup
 *
 * Description:
 *   Bring the WiFi interface up.
 *
 *   Phase 3: disable power save (PS_DISABLED) when the interface comes up
 *   so the RPU is ready for active TX/RX.
 *
 ****************************************************************************/

static int nrf7002_ifup(FAR struct net_driver_s *dev)
{
  FAR struct nrf7002_priv *priv =
    (FAR struct nrf7002_priv *)dev->d_private;
  struct nrf_wifi_umac_chg_vif_state_info vif_state;
  enum nrf_wifi_status status;

  syslog(LOG_INFO, "nrf7002: ifup\n");

  priv->state = NRF7002_STATE_IDLE;

  if (priv->fmac_dev_ctx != NULL && priv->carrier_up == false)
    {
      /* Disable power save so the RPU stays active */

      nrf_wifi_sys_fmac_set_power_save(priv->fmac_dev_ctx,
                                        priv->vif_idx,
                                        false /* PS disabled */);

      /* Set VIF state to UP in the UMAC firmware.
       *
       * The RPU UMAC requires the VIF to be set UP (state=1) via
       * NRF_WIFI_UMAC_CMD_SET_IFFLAGS before it will process scan
       * or connect requests.  Without this, fmac_scan silently
       * accepts the command but the RPU never starts scanning.
       */

      memset(&vif_state, 0, sizeof(vif_state));
      vif_state.state    = 1;            /* UP */
      vif_state.if_index = priv->vif_idx;

      syslog(LOG_ERR, "nrf7002: calling chg_vif_state(UP) vif=%d\n",
             priv->vif_idx);
      status = nrf_wifi_sys_fmac_chg_vif_state(priv->fmac_dev_ctx,
                                                priv->vif_idx,
                                                &vif_state);
      syslog(LOG_ERR, "nrf7002: chg_vif_state returned %d\n", status);
      if (status != NRF_WIFI_STATUS_SUCCESS)
        {
          syslog(LOG_ERR,
                 "nrf7002: chg_vif_state(UP) FAILED: %d\n", status);
        }
      else
        {
          syslog(LOG_ERR, "nrf7002: VIF set UP in UMAC OK\n");
        }
    }

  return OK;
}

/****************************************************************************
 * Name: nrf7002_ifdown
 *
 * Description:
 *   Take the WiFi interface down.
 *
 *   Phase 3: enable power save (PS_ENABLED) when the interface goes down
 *   to reduce current draw while idle.
 *
 ****************************************************************************/

