mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
static int nrf7002_ifdown(FAR struct net_driver_s *dev)
{
  FAR struct nrf7002_priv *priv =
    (FAR struct nrf7002_priv *)dev->d_private;

  syslog(LOG_INFO, "nrf7002: ifdown\n");

  priv->state      = NRF7002_STATE_IDLE;
  priv->carrier_up = false;

  /* Enable power save on ifdown to reduce idle current */

  if (priv->fmac_dev_ctx != NULL)
    {
      nrf_wifi_sys_fmac_set_power_save(priv->fmac_dev_ctx,
                                        priv->vif_idx,
                                        true /* PS enabled */);
    }

  return OK;
}

#ifdef CONFIG_NETDEV_IOCTL

/****************************************************************************
 * Name: nrf7002_ioctl_scan
 *
 * Description:
 *   SIOCSIWSCAN — trigger a background scan.
 *   Clears the cached result table, issues nrf_wifi_sys_fmac_scan, then
 *   issues nrf_wifi_sys_fmac_scan_res_get to ask the RPU to send the
 *   results via scan_res_callbk_fn / scan_done_callbk_fn.
 *
 *   The caller (typically wapi or a scan daemon) should call SIOCGIWSCAN
 *   after the scan completes.  We do a blocking wait with timeout here so
 *   that a simple "wapi scan wlan0" works.
 *
 ****************************************************************************/

static int nrf7002_ioctl_scan(FAR struct nrf7002_priv *priv)
{
  struct nrf_wifi_umac_scan_info scan_info;
  enum nrf_wifi_status           status;
  struct timespec                ts;
  int                            ret;

  if (priv->fmac_dev_ctx == NULL)
    {
      return -ENODEV;
    }

  /* Reset scan state */

  priv->scan_count  = 0;
  priv->scan_done   = false;
  priv->scan_reason = SCAN_DISPLAY;
  priv->state       = NRF7002_STATE_SCANNING;

  memset(&scan_info, 0, sizeof(scan_info));
  scan_info.scan_reason = SCAN_DISPLAY;

  /* Scan all bands (bands=0 means both 2.4 GHz and 5 GHz).
   * This is the default: let the RPU scan everything based on the
   * regulatory domain set during firmware initialization.
   */
  scan_info.scan_params.bands = 0;  /* 0 = all bands */

  /* Trigger the scan */

  syslog(LOG_ERR, "nrf7002: calling fmac_scan vif=%d\n", priv->vif_idx);
  status = nrf_wifi_sys_fmac_scan(priv->fmac_dev_ctx,
                                   priv->vif_idx,
                                   &scan_info);
  syslog(LOG_ERR, "nrf7002: fmac_scan returned %d\n", status);
  if (status != NRF_WIFI_STATUS_SUCCESS)
    {
      syslog(LOG_ERR, "nrf7002: fmac_scan failed (%d)\n", status);
      priv->state = NRF7002_STATE_IDLE;
      return -EIO;
    }

  /* Wait for the scan to complete.
   *
   * Flow:
   *   1. fmac_scan sends TRIGGER_SCAN to RPU
   *   2. RPU sends SCAN_DONE event → scan_done_cb fires
   *   3. scan_done_cb calls fmac_scan_res_get(SCAN_DISPLAY)
   *   4. RPU sends SCAN_DISPLAY_RESULT events → disp_scan_res_cb fires per AP
   *   5. disp_scan_res_cb posts scan_sem when more_res=false (last batch)
   */

  clock_gettime(CLOCK_REALTIME, &ts);
  ts.tv_sec += NRF7002_SCAN_TIMEOUT_MS / 1000;

  ret = nxsem_timedwait(&priv->scan_sem, &ts);
  if (ret == -ETIMEDOUT)
    {
      syslog(LOG_WARNING, "nrf7002: scan timeout\n");
      priv->state = NRF7002_STATE_IDLE;
      return -ETIMEDOUT;
    }

  syslog(LOG_INFO, "nrf7002: scan complete: %d APs found\n",
         priv->scan_count);

  return OK;
}

/****************************************************************************
 * Name: nrf7002_ioctl_get_scan
 *
 * Description:
 *   SIOCGIWSCAN — return cached scan results as iw_event list.
 *
 *   Each AP is serialized as a sequence of iw_event structures written
 *   into the caller's buffer (wrq->u.data.pointer, length wrq->u.data.length).
 *
 *   iw_event layout (simplified):
 *     SIOCGIWAP    : BSSID (struct sockaddr)
 *     SIOCGIWESSID : SSID  (char array, length in u.essid.length)
 *     SIOCGIWFREQ  : frequency (struct iw_freq)
 *
 *   If the buffer is too small we return -E2BIG (caller re-allocates).
 *
 ****************************************************************************/

static int nrf7002_ioctl_get_scan(FAR struct nrf7002_priv *priv,
                                   FAR struct iwreq *wrq)
{
  FAR char                         *buf;
  FAR struct iw_event              *iwe;
  size_t                            buf_len;
  size_t                            written;
  size_t                            ssid_padded;
  int                               i;

  if (wrq == NULL)
    {
      return -EINVAL;
    }

  buf     = wrq->u.data.pointer;
  buf_len = wrq->u.data.length;

  if (buf == NULL || buf_len == 0)
    {
      /* Compute required buffer size (worst-case: all SSIDs at max length) */

      wrq->u.data.length = priv->scan_count *
                           (IW_EV_LEN(ap_addr) + IW_EV_LEN(qual) +
                            IW_EV_LEN(freq)    + IW_EV_LEN(data) +
                            IW_EV_LEN(essid)   + IW_ESSID_MAX_SIZE);
      return -E2BIG;
    }

  written = 0;

  for (i = 0; i < priv->scan_count; i++)
    {
      const struct nrf7002_scan_result *res = &priv->scan_results[i];

      /* ssid_padded: SSID data length rounded up to 4-byte boundary */

      ssid_padded = ((res->ssid_len + 3) & ~3u);

      /* --- SIOCGIWAP: BSSID --- */

      if (written + IW_EV_LEN(ap_addr) > buf_len)
        {
          return -E2BIG;
        }

      iwe = (FAR struct iw_event *)(buf + written);
      memset(iwe, 0, IW_EV_LEN(ap_addr));
      iwe->cmd = SIOCGIWAP;
      iwe->len = (uint16_t)IW_EV_LEN(ap_addr);
      iwe->u.ap_addr.sa_family = ARPHRD_ETHER;
      memcpy(iwe->u.ap_addr.sa_data, res->bssid, NRF7002_MAC_ADDR_LEN);
      written += IW_EV_LEN(ap_addr);

      /* --- SIOCGIWESSID: SSID (variable length, 4-byte aligned) ---
       *
       * Layout in stream: [iw_event header + essid union][SSID bytes...]
       * essid.pointer must be set to sizeof(iwe->u.essid) so the consumer
       * can locate the inline data (offset from start of iwe->u.essid).
       * iwe->len covers the fixed header plus the padded SSID payload.
       */

      if (written + IW_EV_LEN(essid) + ssid_padded > buf_len)
        {
          return -E2BIG;
        }

      iwe = (FAR struct iw_event *)(buf + written);
      memset(iwe, 0, IW_EV_LEN(essid) + ssid_padded);
      iwe->cmd              = SIOCGIWESSID;
      iwe->len              = (uint16_t)(IW_EV_LEN(essid) + ssid_padded);
      iwe->u.essid.flags    = 1;
      iwe->u.essid.length   = (uint16_t)res->ssid_len;
      iwe->u.essid.pointer  = (FAR void *)sizeof(iwe->u.essid);
      memcpy(&iwe->u.essid + 1, res->ssid, res->ssid_len);
      written += IW_EV_LEN(essid) + ssid_padded;

      /* --- IWEVQUAL: Signal quality --- */

      if (written + IW_EV_LEN(qual) > buf_len)
        {
          return -E2BIG;
        }

      iwe = (FAR struct iw_event *)(buf + written);
      memset(iwe, 0, IW_EV_LEN(qual));
      iwe->cmd                = IWEVQUAL;
      iwe->len                = (uint16_t)IW_EV_LEN(qual);
      iwe->u.qual.level       = (uint8_t)(res->rssi & 0xff);
      iwe->u.qual.updated     = IW_QUAL_DBM | IW_QUAL_ALL_UPDATED;
      written += IW_EV_LEN(qual);

      /* --- SIOCGIWFREQ: Channel frequency --- */

      if (written + IW_EV_LEN(freq) > buf_len)
        {
          return -E2BIG;
        }

      iwe = (FAR struct iw_event *)(buf + written);
      memset(iwe, 0, IW_EV_LEN(freq));
      iwe->cmd      = SIOCGIWFREQ;
      iwe->len      = (uint16_t)IW_EV_LEN(freq);
      iwe->u.freq.m = (int32_t)res->frequency;
      iwe->u.freq.e = 6; /* MHz: value * 10^6 → Hz */
      written += IW_EV_LEN(freq);

      /* --- SIOCGIWENCODE: Security / encryption mode --- */

