mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
      if (written + IW_EV_LEN(data) > buf_len)
        {
          return -E2BIG;
        }

      iwe = (FAR struct iw_event *)(buf + written);
      memset(iwe, 0, IW_EV_LEN(data));
      iwe->cmd          = SIOCGIWENCODE;
      iwe->len          = (uint16_t)IW_EV_LEN(data);
      iwe->u.data.flags = (res->security == NRF7002_SECURITY_OPEN)
                          ? IW_ENCODE_DISABLED
                          : (IW_ENCODE_ENABLED | IW_ENCODE_NOKEY);
      iwe->u.data.length = 0;
      written += IW_EV_LEN(data);
    }

  wrq->u.data.length = (uint16_t)written;
  return OK;
}

/****************************************************************************
 * Name: nrf7002_ioctl_connect
 *
 * Description:
 *   SIOCSIWAP — trigger a connection using the stored SSID and auth params.
 *
 *   802.11 connection sequence via NCS FMAC:
 *     1. nrf_wifi_sys_fmac_auth   (authentication request)
 *     2. nrf_wifi_sys_fmac_assoc  (association request)
 *
 *   The FMAC will call if_carr_state_chg_callbk_fn on success.
 *
 ****************************************************************************/

static void nrf7002_ioctl_connect(FAR void *arg)
{
  FAR struct nrf7002_priv        *priv = (FAR struct nrf7002_priv *)arg;
  struct nrf_wifi_umac_auth_info  auth_info;
  enum nrf_wifi_status            status;
  uint32_t                        ap_freq = 0;
  int                             i;
  bool                            bssid_zero;

  if (priv->fmac_dev_ctx == NULL)
    {
      syslog(LOG_ERR, "nrf7002: connect: no FMAC context\n");
      return;
    }

  if (priv->target_ssid_len == 0)
    {
      syslog(LOG_ERR, "nrf7002: connect: no SSID set\n");
      return;
    }

  /* Look up the target AP in the cached scan results to get the channel
   * frequency.  The RPU requires the frequency to be set in the auth
   * command; without it the auth frame is not transmitted on air.
   */

  bssid_zero = true;
  for (i = 0; i < NRF7002_MAC_ADDR_LEN; i++)
    {
      if (priv->target_bssid[i] != 0)
        {
          bssid_zero = false;
          break;
        }
    }

  /* First pass: exact BSSID match (when a specific AP was requested) */

  for (i = 0; i < priv->scan_count; i++)
    {
      const struct nrf7002_scan_result *r = &priv->scan_results[i];

      if (!bssid_zero &&
          memcmp(r->bssid, priv->target_bssid, NRF7002_MAC_ADDR_LEN) == 0)
        {
          ap_freq = r->frequency;
          break;
        }
    }

  /* Second pass: SSID match — used when:
   *  - target_bssid is all-zero (wapi ap wlan0 any), or
   *  - target_bssid is non-zero garbage (sscanf("any") failed) and did
   *    not match any cached BSSID.  Fall back to SSID lookup.
   */

  if (ap_freq == 0 && priv->target_ssid_len > 0)
    {
      for (i = 0; i < priv->scan_count; i++)
        {
          const struct nrf7002_scan_result *r = &priv->scan_results[i];

          if (strncmp(r->ssid, priv->target_ssid, NRF7002_MAX_SSID_LEN) == 0)
            {
              ap_freq = r->frequency;
              /* Store the real BSSID so the RPU targets this specific AP */
              memcpy(priv->target_bssid, r->bssid, NRF7002_MAC_ADDR_LEN);
              syslog(LOG_INFO, "nrf7002: SSID match: bssid=%02x:%02x:%02x:%02x:%02x:%02x\n",
                     r->bssid[0], r->bssid[1], r->bssid[2],
                     r->bssid[3], r->bssid[4], r->bssid[5]);
              break;
            }
        }
    }

  if (ap_freq == 0 && priv->target_freq != 0)
    {
      ap_freq = priv->target_freq;
      syslog(LOG_INFO, "nrf7002: connect: using user-set freq=%lu MHz\n",
             (unsigned long)ap_freq);
    }

  if (ap_freq == 0)
    {
      syslog(LOG_WARNING, "nrf7002: connect: AP '%s' not in scan cache,"
             " will do all-channel SCAN_CONNECT\n", priv->target_ssid);
    }
  else
    {
      syslog(LOG_INFO, "nrf7002: connect: AP '%s' freq=%lu MHz\n",
             priv->target_ssid, (unsigned long)ap_freq);
    }

  syslog(LOG_INFO, "nrf7002: connecting to '%s' freq=%lu MHz\n",
         priv->target_ssid, (unsigned long)ap_freq);

  uint16_t saved_capability      = 0;
  uint16_t saved_beacon_interval = 0;
  int32_t  saved_signal          = 0;
  uint64_t saved_tsf             = 0;

  /* Skip local deauth before first connect attempt.
   * The local-state-change deauth may clear the RPU's BSS database for the
   * target BSSID, causing CMD_AUTHENTICATE to return ENOENT.
   * Only deauth after a failed assoc (handled in auth retry loop).
   */

  /* --- SCAN_CONNECT + Auth + Assoc flow ---
   *
   * The nRF7002 UMAC firmware maintains an internal BSS database populated by
   * probe responses captured during SCAN_CONNECT (active probe scan).
   * CMD_AUTHENTICATE requires the target BSSID to be in this BSS database;
   * without it the firmware returns ENOENT (-2).
   *
   * CRITICAL: after SCAN_DONE for SCAN_CONNECT, do NOT call GET_SCAN_RESULTS.
   * GET_SCAN_RESULTS(SCAN_CONNECT) consumes the BSS database entries, causing
   * the subsequent auth to fail with ENOENT.  scan_done_cb returns immediately
   * for SCAN_CONNECT without calling GET_SCAN_RESULTS.
   */

#define NRF7002_AUTH_RETRIES   3
#define NRF7002_AUTH_TIMEOUT_S 8
#define NRF7002_ASSOC_TIMEOUT_S 10

  /* --- SCAN_CONNECT: active probe to populate RPU BSS database --- */

  {
    struct nrf_wifi_umac_scan_info *connect_scan;
    size_t alloc_sz = sizeof(*connect_scan) + sizeof(uint32_t);
    struct timespec sc_ts;
    int sc_ret;

    /* Drain stale scan_sem */

    while (nxsem_trywait(&priv->scan_sem) == OK)
      {
        /* drained */
      }

    connect_scan = kmm_zalloc(alloc_sz);
    if (connect_scan)
      {
        enum nrf_wifi_status sc_status;

        connect_scan->scan_reason = SCAN_CONNECT;
        connect_scan->scan_params.num_scan_ssids = 1;
        connect_scan->scan_params.scan_ssids[0].nrf_wifi_ssid_len =
            (unsigned char)priv->target_ssid_len;
        memcpy(connect_scan->scan_params.scan_ssids[0].nrf_wifi_ssid,
               priv->target_ssid, priv->target_ssid_len);

        if (ap_freq != 0)
          {
            connect_scan->scan_params.center_frequency[0] = ap_freq;
            connect_scan->scan_params.num_scan_channels   = 1;
          }

