mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
        priv->scan_count  = 0;
        priv->scan_done   = false;
        priv->scan_reason = SCAN_CONNECT;
        priv->state       = NRF7002_STATE_SCANNING;

        syslog(LOG_INFO, "nrf7002: SCAN_CONNECT for '%s' freq=%lu MHz\n",
               priv->target_ssid, (unsigned long)ap_freq);

        sc_status = nrf_wifi_sys_fmac_scan(priv->fmac_dev_ctx,
                                           priv->vif_idx,
                                           connect_scan);
        if (sc_status != NRF_WIFI_STATUS_SUCCESS)
          {
            syslog(LOG_WARNING, "nrf7002: SCAN_CONNECT failed (%d)\n",
                   (int)sc_status);
            priv->state = NRF7002_STATE_IDLE;
          }
        else
          {
            clock_gettime(CLOCK_REALTIME, &sc_ts);
            sc_ts.tv_sec += NRF7002_SCAN_TIMEOUT_MS / 1000;
            sc_ret = nxsem_timedwait(&priv->scan_sem, &sc_ts);
            if (sc_ret == -ETIMEDOUT || !priv->scan_done)
              {
                syslog(LOG_WARNING, "nrf7002: SCAN_CONNECT timeout/fail\n");
              }
            else
              {
                syslog(LOG_INFO, "nrf7002: SCAN_CONNECT done\n");
              }
          }

        kmm_free(connect_scan);
      }
    else
      {
        syslog(LOG_ERR, "nrf7002: SCAN_CONNECT alloc failed\n");
      }
  }

  /* After SCAN_CONNECT, re-do BSS lookup from the updated scan cache.
   * SCAN_CONNECT may overwrite scan_results[] with full BSS data.
   * If SCAN_CONNECT returned empty results, ap_freq from the pre-scan
   * display cache is still valid — keep it.
   */

  if (priv->scan_count > 1 ||
      (priv->scan_count == 1 && priv->scan_results[0].frequency != 0))
    {
      /* SCAN_CONNECT returned real results — re-lookup */

      uint32_t sc_freq = 0;

      bssid_zero = true;
      for (i = 0; i < NRF7002_MAC_ADDR_LEN; i++)
        {
          if (priv->target_bssid[i] != 0)
            {
              bssid_zero = false;
              break;
            }
        }

      for (i = 0; i < priv->scan_count; i++)
        {
          const struct nrf7002_scan_result *r = &priv->scan_results[i];

          if (!bssid_zero &&
              memcmp(r->bssid, priv->target_bssid, NRF7002_MAC_ADDR_LEN) == 0)
            {
              sc_freq = r->frequency;
              break;
            }
        }

      if (sc_freq == 0 && priv->target_ssid_len > 0)
        {
          for (i = 0; i < priv->scan_count; i++)
            {
              const struct nrf7002_scan_result *r = &priv->scan_results[i];

              if (strncmp(r->ssid, priv->target_ssid, NRF7002_MAX_SSID_LEN) == 0)
                {
                  sc_freq = r->frequency;
                  memcpy(priv->target_bssid, r->bssid, NRF7002_MAC_ADDR_LEN);
                  syslog(LOG_INFO,
                         "nrf7002: post-SCAN_CONNECT BSS:"
                         " bssid=%02x:%02x:%02x:%02x:%02x:%02x"
                         " freq=%lu\n",
                         r->bssid[0], r->bssid[1], r->bssid[2],
                         r->bssid[3], r->bssid[4], r->bssid[5],
                         (unsigned long)sc_freq);
                  break;
                }
            }
        }

      if (sc_freq != 0)
        {
          ap_freq = sc_freq;
        }
    }
  else
    {
      /* SCAN_CONNECT returned empty — keep ap_freq from display scan cache */

      syslog(LOG_INFO, "nrf7002: SCAN_CONNECT empty, using cached freq=%lu\n",
             (unsigned long)ap_freq);
    }

  /* Re-populate saved BSS context from updated scan cache */

  saved_capability      = 0;
  saved_beacon_interval = 0;
  saved_signal          = 0;
  saved_tsf             = 0;

  for (i = 0; i < priv->scan_count; i++)
    {
      const struct nrf7002_scan_result *r = &priv->scan_results[i];
      if (memcmp(r->bssid, priv->target_bssid, NRF7002_MAC_ADDR_LEN) == 0)
        {
          saved_capability      = r->capability;
          saved_beacon_interval = r->beacon_interval;
          saved_signal          = (int32_t)r->rssi;
          saved_tsf             = r->tsf;
          syslog(LOG_INFO,
                 "nrf7002: BSS context: cap=0x%04x bi=%u signal=%d tsf=%llu\n",
                 saved_capability, saved_beacon_interval,
                 (int)saved_signal, (unsigned long long)saved_tsf);
          break;
        }
    }

  if (ap_freq == 0)
    {
      syslog(LOG_ERR, "nrf7002: target AP '%s' not found after SCAN_CONNECT\n",
             priv->target_ssid);
      priv->state = NRF7002_STATE_IDLE;
      return;
    }

  priv->ap_freq = ap_freq;

  {
    int  auth_attempt;
    bool auth_ok = false;

    /* Drain leftover semaphore counts from any previous attempt */

    while (nxsem_trywait(&priv->auth_sem) == OK)
      {
        /* drained */
      }

    while (nxsem_trywait(&priv->assoc_sem) == OK)
      {
        /* drained */
      }

    for (auth_attempt = 0;
         auth_attempt < NRF7002_AUTH_RETRIES && !auth_ok;
         auth_attempt++)
      {
        struct timespec ts;
        int             ret;

        if (auth_attempt > 0)
          {
            syslog(LOG_INFO, "nrf7002: auth retry %d/%d\n",
                   auth_attempt + 1, NRF7002_AUTH_RETRIES);
            nxsig_usleep(500000); /* 500 ms back-off */
          }

        /* Build auth_info from SCAN_CONNECT cache */

        priv->ap_freq = ap_freq;
        priv->state   = NRF7002_STATE_AUTHENTICATING;

        memset(&auth_info, 0, sizeof(auth_info));

        auth_info.auth_type = NRF_WIFI_AUTHTYPE_OPEN_SYSTEM;

        memcpy(auth_info.nrf_wifi_bssid, priv->target_bssid,
               NRF7002_MAC_ADDR_LEN);

        auth_info.frequency = ap_freq;

        auth_info.ssid.nrf_wifi_ssid_len = (unsigned char)priv->target_ssid_len;
        memcpy(auth_info.ssid.nrf_wifi_ssid, priv->target_ssid,
               priv->target_ssid_len);

        /* For WPA2 networks, include a minimal RSN IE in the auth command.
         * This mirrors Zephyr/wpa_supplicant behaviour: when params->ie is
         * non-NULL the firmware uses the IE to populate its BSS database
         * (security context) instead of the cap/signal/tsf fields.
         * Without an IE, the firmware returns ENOENT for OPEN_SYSTEM auth
         * against WPA2 APs because it cannot identify the security context.
         *
         * RSN IE: WPA2-PSK (AES-CCMP) minimal form, 22 bytes:
         *   30 14 01 00 00 0f ac 04  01 00 00 0f ac 04  01 00 00 0f ac 02  00 00
         */

        /* Fill BSS context from display-scan cache.
         * Zephyr fills these fields from curr_bss (wpa_bss) which is
         * populated from GET_SCAN_RESULTS(SCAN_DISPLAY).  The from_beacon
         * field is hard-coded to 0 in Zephyr's wpa_supp_if.c.
         * No IE is included for standard WPA2-PSK OPEN_SYSTEM auth
         * (IE is only used for FT/SAE in wpa_supplicant).
         */

        auth_info.capability      = saved_capability;
        auth_info.beacon_interval = saved_beacon_interval;
        auth_info.nrf_wifi_signal = saved_signal;
        auth_info.tsf             = saved_tsf;
        auth_info.scan_width      = 0;
        auth_info.from_beacon     = 0; /* hardcoded 0 per Zephyr wpa_supp_if.c */

        syslog(LOG_INFO, "nrf7002: auth attempt %d:"
               " bssid=%02x:%02x:%02x:%02x:%02x:%02x"
               " freq=%lu cap=0x%04x bi=%u signal=%d tsf=%llu\n",
               auth_attempt + 1,
               auth_info.nrf_wifi_bssid[0], auth_info.nrf_wifi_bssid[1],
               auth_info.nrf_wifi_bssid[2], auth_info.nrf_wifi_bssid[3],
               auth_info.nrf_wifi_bssid[4], auth_info.nrf_wifi_bssid[5],
               (unsigned long)auth_info.frequency,
               (unsigned)auth_info.capability,
               (unsigned)auth_info.beacon_interval,
               (int)auth_info.nrf_wifi_signal,
               (unsigned long long)auth_info.tsf);

