mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
        /* Drain auth_sem before sending auth */

        while (nxsem_trywait(&priv->auth_sem) == OK)
          {
            /* drained */
          }

        priv->auth_failed = false;

        status = nrf_wifi_sys_fmac_auth(priv->fmac_dev_ctx,
                                        priv->vif_idx,
                                        &auth_info);
        if (status != NRF_WIFI_STATUS_SUCCESS)
          {
            syslog(LOG_ERR, "nrf7002: fmac_auth submit failed (%d),"
                   " retrying\n", (int)status);
            priv->state = NRF7002_STATE_IDLE;
            nxsig_usleep(200000);
            continue;
          }

        syslog(LOG_INFO, "nrf7002: auth request sent, waiting %ds\n",
               NRF7002_AUTH_TIMEOUT_S);

        clock_gettime(CLOCK_REALTIME, &ts);
        ts.tv_sec += NRF7002_AUTH_TIMEOUT_S;
        ret = nxsem_timedwait(&priv->auth_sem, &ts);

        if (ret == -ETIMEDOUT)
          {
            syslog(LOG_WARNING, "nrf7002: auth timeout attempt %d\n",
                   auth_attempt + 1);
            priv->state = NRF7002_STATE_IDLE;
          }
        else if (priv->auth_failed)
          {
            syslog(LOG_WARNING, "nrf7002: auth rejected attempt %d\n",
                   auth_attempt + 1);
            priv->state = NRF7002_STATE_IDLE;
          }
        else
          {
            /* Auth accepted.  Send association request from this LPWORK
             * thread so the large assoc_info struct lives here rather than
             * in the shallow HPWORK auth_resp_cb stack.
             */

            {
              struct nrf_wifi_umac_assoc_info assoc_info;
              enum nrf_wifi_status            fmac_st;

              memset(&assoc_info, 0, sizeof(assoc_info));

              assoc_info.ssid.nrf_wifi_ssid_len =
                (unsigned char)priv->target_ssid_len;
              memcpy(assoc_info.ssid.nrf_wifi_ssid, priv->target_ssid,
                     priv->target_ssid_len);

              memcpy(assoc_info.nrf_wifi_bssid, priv->target_bssid,
                     NRF7002_MAC_ADDR_LEN);

              assoc_info.center_frequency = priv->ap_freq;

              if (priv->security_type == NRF7002_SECURITY_WPA2)
                {
                  assoc_info.conn_type = NRF_WIFI_CONN_TYPE_SECURE;

                  /* RSN IE for WPA2-Personal CCMP/PSK, no PMF */

                  static const unsigned char rsn_ie[] =
                    {
                      0x30, 0x14,
                      0x01, 0x00,
                      0x00, 0x0f, 0xac, 0x04,
                      0x01, 0x00,
                      0x00, 0x0f, 0xac, 0x04,
                      0x01, 0x00,
                      0x00, 0x0f, 0xac, 0x02,
                      0x00, 0x00
                    };
                  assoc_info.wpa_ie.ie_len = (signed int)sizeof(rsn_ie);
                  memcpy(assoc_info.wpa_ie.ie, rsn_ie, sizeof(rsn_ie));
                  assoc_info.control_port = 1;
                }
              else
                {
                  assoc_info.conn_type    = NRF_WIFI_CONN_TYPE_OPEN;
                  assoc_info.control_port = 0;
                }

              priv->state = NRF7002_STATE_ASSOCIATING;

              /* Drain assoc_sem before sending */

              while (nxsem_trywait(&priv->assoc_sem) == OK)
                {
                  /* drained */
                }

              priv->assoc_failed = false;

              fmac_st = nrf_wifi_sys_fmac_assoc(priv->fmac_dev_ctx,
                                                 priv->vif_idx,
                                                 &assoc_info);
              if (fmac_st != NRF_WIFI_STATUS_SUCCESS)
                {
                  syslog(LOG_ERR,
                         "nrf7002: fmac_assoc failed (%d), attempt %d\n",
                         (int)fmac_st, auth_attempt + 1);
                  priv->state = NRF7002_STATE_IDLE;
                  continue;
                }

              syslog(LOG_INFO, "nrf7002: assoc request sent attempt %d,"
                     " waiting %ds\n",
                     auth_attempt + 1, NRF7002_ASSOC_TIMEOUT_S);
            }

            clock_gettime(CLOCK_REALTIME, &ts);
            ts.tv_sec += NRF7002_ASSOC_TIMEOUT_S;
            ret = nxsem_timedwait(&priv->assoc_sem, &ts);

            if (ret == -ETIMEDOUT)
              {
                syslog(LOG_WARNING, "nrf7002: assoc timeout attempt %d\n",
                       auth_attempt + 1);
                priv->state = NRF7002_STATE_IDLE;
              }
            else if (priv->assoc_failed)
              {
                syslog(LOG_WARNING, "nrf7002: assoc rejected attempt %d\n",
                       auth_attempt + 1);
                priv->state = NRF7002_STATE_IDLE;
              }
            else
              {
                syslog(LOG_INFO, "nrf7002: assoc OK attempt %d,"
                       " carrier UP\n", auth_attempt + 1);
                auth_ok = true;
              }
          }
      }

    if (!auth_ok)
      {
        syslog(LOG_ERR, "nrf7002: connect failed after %d attempts\n",
               NRF7002_AUTH_RETRIES);
        priv->state = NRF7002_STATE_IDLE;
        return;
      }
  }

  syslog(LOG_INFO, "nrf7002: connect_work completed OK\n");
}

#ifdef CONFIG_IEEE80211_NRF7002_AP_MODE

/****************************************************************************
 * Name: nrf7002_ap_start
 *
 * Description:
 *   Stub: start the SoftAP.
 *
 *   Calls nrf_wifi_sys_fmac_start_ap with a minimal AP configuration.
 *   This requires NRF70_SYSTEM_WITH_RAW_MODES (or similar) to be defined
 *   in the NCS build to enable the AP mode FMAC path.
 *
 ****************************************************************************/

static int nrf7002_ap_start(FAR struct nrf7002_priv *priv)
{
  struct nrf_wifi_umac_start_ap_info ap_info;
  enum nrf_wifi_status               status;

  if (priv->fmac_dev_ctx == NULL)
    {
      return -ENODEV;
    }

  memset(&ap_info, 0, sizeof(ap_info));

  /* Minimal SoftAP config using stored SSID.
   * Caller is expected to set SSID via SIOCSIWESSID before SIOCSIWMODE.
   */

  if (priv->target_ssid_len > 0)
    {
      ap_info.ssid.nrf_wifi_ssid_len = (unsigned char)priv->target_ssid_len;
      memcpy(ap_info.ssid.nrf_wifi_ssid, priv->target_ssid,
             priv->target_ssid_len);
    }

  status = nrf_wifi_sys_fmac_start_ap(priv->fmac_dev_ctx,
                                       priv->vif_idx,
                                       &ap_info);
  if (status != NRF_WIFI_STATUS_SUCCESS)
    {
      syslog(LOG_ERR, "nrf7002: start_ap failed (%d)\n", status);
      return -EIO;
    }

