mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
  syslog(LOG_INFO, "nrf7002: SoftAP started\n");
  return OK;
}

#endif /* CONFIG_IEEE80211_NRF7002_AP_MODE */

/****************************************************************************
 * Name: nrf7002_ioctl
 *
 * Description:
 *   Handle wireless extension IOCTLs.
 *
 *   SIOCSIWSCAN   — trigger RPU scan (blocks until done or timeout)
 *   SIOCGIWSCAN   — return cached scan results as iw_event stream
 *   SIOCSIWESSID  — store target SSID
 *   SIOCSIWAUTH   — store security parameters
 *   SIOCSIWAP     — trigger connection using stored SSID + auth
 *   SIOCSIWENCODE — store passphrase (WEP legacy — reused for WPA2 PSK)
 *   SIOCGIWSTATS  — return RSSI from last scan (Phase 3)
 *   SIOCSIWMODE   — set operation mode; IW_MODE_MASTER starts AP (Phase 3)
 *
 *   All other commands return -ENOTTY.
 *
 ****************************************************************************/

static int nrf7002_ioctl(FAR struct net_driver_s *dev,
                          int cmd, unsigned long arg)
{
  FAR struct nrf7002_priv *priv =
    (FAR struct nrf7002_priv *)dev->d_private;
  FAR struct iwreq        *wrq  = (FAR struct iwreq *)(uintptr_t)arg;
  int                      ret  = -ENOTTY;

  syslog(LOG_ERR, "nrf7002: ioctl cmd=0x%04x\n", cmd);

  switch (cmd)
    {
      /* ------------------------------------------------------------------ */
      /* Initiate a scan                                                       */
      /* ------------------------------------------------------------------ */

      case SIOCSIWSCAN:
        syslog(LOG_INFO, "nrf7002: SIOCSIWSCAN\n");
        ret = nrf7002_ioctl_scan(priv);
        break;

      /* ------------------------------------------------------------------ */
      /* SIOCSIWFREQ — store user-specified channel frequency                 */
      /* ------------------------------------------------------------------ */

      case SIOCSIWFREQ:
        if (wrq != NULL)
          {
            uint32_t freq_mhz = 0;

            syslog(LOG_INFO, "nrf7002: SIOCSIWFREQ m=%ld e=%d\n",
                   (long)wrq->u.freq.m, (int)wrq->u.freq.e);

            if (wrq->u.freq.e == 6)
              {
                freq_mhz = (uint32_t)(wrq->u.freq.m);       /* already MHz */
              }
            else if (wrq->u.freq.e == 0 && wrq->u.freq.m >= 1 &&
                     wrq->u.freq.m <= 200)
              {
                /* channel number — convert to MHz */
                if (wrq->u.freq.m <= 13)
                  freq_mhz = 2412 + (wrq->u.freq.m - 1) * 5;
                else if (wrq->u.freq.m == 14)
                  freq_mhz = 2484;
                else if (wrq->u.freq.m >= 36)
                  freq_mhz = 5000 + wrq->u.freq.m * 5;
              }
            else if (wrq->u.freq.e == 0 && wrq->u.freq.m > 200)
              {
                /* wapi passes MHz directly with e=0 when value > 200 */
                freq_mhz = (uint32_t)wrq->u.freq.m;
              }
            else if (wrq->u.freq.e >= 1)
              {
                /* value in Hz * 10^e — convert to MHz */
                uint64_t hz = (uint64_t)wrq->u.freq.m;
                int      e  = (int)wrq->u.freq.e;
                while (e-- > 0) hz *= 10;
                freq_mhz = (uint32_t)(hz / 1000000);
              }

            if (freq_mhz != 0)
              {
                priv->target_freq = freq_mhz;
                syslog(LOG_INFO, "nrf7002: SIOCSIWFREQ -> %lu MHz\n",
                       (unsigned long)freq_mhz);
              }
          }

        ret = OK;
        break;

      /* ------------------------------------------------------------------ */
      /* Retrieve cached scan results                                          */
      /* ------------------------------------------------------------------ */

      case SIOCGIWSCAN:
        syslog(LOG_INFO, "nrf7002: SIOCGIWSCAN (count=%d)\n",
               priv->scan_count);
        ret = nrf7002_ioctl_get_scan(priv, wrq);
        break;

      /* ------------------------------------------------------------------ */
      /* Store target SSID                                                     */
      /* ------------------------------------------------------------------ */

      case SIOCSIWESSID:
        if (wrq == NULL || wrq->u.essid.pointer == NULL)
          {
            ret = -EINVAL;
            break;
          }

        {
          size_t len = wrq->u.essid.length;

          if (len > NRF7002_MAX_SSID_LEN)
            {
              len = NRF7002_MAX_SSID_LEN;
            }

          memcpy(priv->target_ssid, wrq->u.essid.pointer, len);
          priv->target_ssid[len] = '\0';
          priv->target_ssid_len  = (int)len;

          syslog(LOG_INFO, "nrf7002: ESSID set to '%s'\n",
                 priv->target_ssid);

          /* Re-derive PMK if passphrase is already stored. */

          if (priv->pmk_valid && len > 0)
            {
              nrf7002_wpa_derive_pmk(priv->passphrase,
                                      (const uint8_t *)priv->target_ssid,
                                      (uint32_t)len,
                                      priv->pmk);
              priv->ptk_valid = 0;
              syslog(LOG_INFO, "nrf7002: PMK re-derived for new SSID\n");
            }

          ret = OK;
        }
        break;

      /* ------------------------------------------------------------------ */
      /* Store security type (open vs WPA2)                                   */
      /* ------------------------------------------------------------------ */

      case SIOCSIWAUTH:
        if (wrq == NULL)
          {
            ret = -EINVAL;
            break;
          }

        /* IW_AUTH_80211_AUTH_ALG: 0x1 = open, 0x2 = shared key */
        /* IW_AUTH_WPA_VERSION    : 0x0 = disabled, 0x2 = WPA2  */

        if (wrq->u.param.flags == IW_AUTH_WPA_VERSION)
          {
            priv->security_type =
              (wrq->u.param.value == IW_AUTH_WPA_VERSION_WPA2)
              ? NRF7002_SECURITY_WPA2
              : NRF7002_SECURITY_OPEN;

            syslog(LOG_INFO, "nrf7002: auth WPA version -> security=%d\n",
                   priv->security_type);
          }

        ret = OK;
        break;

