mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
      /* ------------------------------------------------------------------ */
      /* Store passphrase (reusing SIOCSIWENCODE for WPA PSK)                 */
      /* ------------------------------------------------------------------ */

      case SIOCSIWENCODE:
        if (wrq == NULL)
          {
            ret = -EINVAL;
            break;
          }

        if (wrq->u.encoding.pointer != NULL &&
            wrq->u.encoding.length > 0)
          {
            size_t psk_len = wrq->u.encoding.length;

            if (psk_len >= NRF7002_MAX_PASSPHRASE_LEN)
              {
                psk_len = NRF7002_MAX_PASSPHRASE_LEN - 1;
              }

            memcpy(priv->passphrase, wrq->u.encoding.pointer, psk_len);
            priv->passphrase[psk_len] = '\0';

            syslog(LOG_INFO, "nrf7002: passphrase stored (%zu bytes)\n",
                   psk_len);

            /* Pre-derive PMK if SSID is already known.
             * PBKDF2-SHA1(4096) is ~500ms on Cortex-M33; run it once here
             * during configuration rather than at handshake time.
             */

            if (priv->target_ssid_len > 0)
              {
                nrf7002_wpa_derive_pmk(priv->passphrase,
                                        (const uint8_t *)priv->target_ssid,
                                        (uint32_t)priv->target_ssid_len,
                                        priv->pmk);
                priv->pmk_valid  = 1;
                priv->ptk_valid  = 0;
                syslog(LOG_INFO, "nrf7002: PMK derived (ssid=%s)\n",
                       priv->target_ssid);
              }
          }

        ret = OK;
        break;

      /* ------------------------------------------------------------------ */
      /* SIOCSIWENCODEEXT — WPA2-PSK passphrase from wapi psk command        */
      /* ------------------------------------------------------------------ */

      case SIOCSIWENCODEEXT:
        if (wrq != NULL && wrq->u.encoding.pointer != NULL &&
            wrq->u.encoding.length >= (int)sizeof(struct iw_encode_ext))
          {
            const struct iw_encode_ext *ext =
              (const struct iw_encode_ext *)wrq->u.encoding.pointer;

            if (ext->key_len > 0)
              {
                size_t psk_len = ext->key_len;

                if (psk_len >= NRF7002_MAX_PASSPHRASE_LEN)
                  {
                    psk_len = NRF7002_MAX_PASSPHRASE_LEN - 1;
                  }

                memcpy(priv->passphrase, ext->key, psk_len);
                priv->passphrase[psk_len] = '\0';

                syslog(LOG_INFO,
                       "nrf7002: ENCODEEXT passphrase stored (%zu bytes)\n",
                       psk_len);

                if (priv->target_ssid_len > 0)
                  {
                    nrf7002_wpa_derive_pmk(priv->passphrase,
                                            (const uint8_t *)priv->target_ssid,
                                            (uint32_t)priv->target_ssid_len,
                                            priv->pmk);
                    priv->pmk_valid = 1;
                    priv->ptk_valid = 0;
                    syslog(LOG_INFO, "nrf7002: PMK derived (ssid=%s)\n",
                           priv->target_ssid);
                  }
              }
          }

        ret = OK;
        break;

      /* ------------------------------------------------------------------ */
      /* Connect (auth + assoc) using stored SSID/auth/passphrase             */
      /* ------------------------------------------------------------------ */

      case SIOCSIWAP:
        syslog(LOG_INFO, "nrf7002: SIOCSIWAP (connect async)\n");

        /* If a specific BSSID was given, store it */

        if (wrq != NULL &&
            wrq->u.ap_addr.sa_family == ARPHRD_ETHER)
          {
            memcpy(priv->target_bssid, wrq->u.ap_addr.sa_data,
                   NRF7002_MAC_ADDR_LEN);
          }

        /* Run connect in LPWORK so the IOCTL caller (NSH) is not blocked
         * during auth/assoc semaphore waits (which can take up to 15s).
         * nrf7002_ioctl_connect posts carrier-on via if_carr_state_chg_cb
         * when association succeeds.
         */

        work_cancel(LPWORK, &priv->connect_work);
        ret = work_queue(LPWORK, &priv->connect_work,
                         (worker_t)nrf7002_ioctl_connect, priv, 0);
        if (ret < 0)
          {
            syslog(LOG_ERR, "nrf7002: work_queue connect failed: %d\n", ret);
          }
        else
          {
            ret = OK;
          }

        break;

      /* ------------------------------------------------------------------ */
      /* Phase 3: Return link statistics (RSSI from last scan)                */
      /* ------------------------------------------------------------------ */

      case SIOCGIWSTATS:
        {
          FAR struct iw_statistics *stats;
          int                       i;

          if (wrq == NULL)
            {
              ret = -EINVAL;
              break;
            }

          stats = (FAR struct iw_statistics *)wrq->u.data.pointer;
          if (stats == NULL)
            {
              ret = -EINVAL;
              break;
            }

          memset(stats, 0, sizeof(*stats));

          /* Populate RSSI from last scan result matching the connected BSSID.
           * If not associated, return the stored last_rssi value.
           */

          if (priv->state == NRF7002_STATE_ASSOCIATED)
            {
              for (i = 0; i < priv->scan_count; i++)
                {
                  if (memcmp(priv->scan_results[i].bssid,
                             priv->target_bssid,
                             NRF7002_MAC_ADDR_LEN) == 0)
                    {
                      priv->last_rssi = priv->scan_results[i].rssi;
                      break;
                    }
                }
            }

          /* level field is uint8_t in iw_quality; map dBm to 0-255 range.
           * Convention: level = (uint8_t)(rssi + 256) for negative dBm.
           */

          stats->qual.level   = (uint8_t)((int)priv->last_rssi & 0xff);
          stats->qual.updated = IW_QUAL_LEVEL_UPDATED | IW_QUAL_DBM;

