mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_netdev.c
          syslog(LOG_DEBUG, "nrf7002: SIOCGIWSTATS rssi=%d\n",
                 priv->last_rssi);
          ret = OK;
        }
        break;

      /* ------------------------------------------------------------------ */
      /* Phase 3: Set operation mode (AP mode stub)                           */
      /* ------------------------------------------------------------------ */

      case SIOCSIWMODE:
        {
          if (wrq == NULL)
            {
              ret = -EINVAL;
              break;
            }

#ifdef CONFIG_IEEE80211_NRF7002_AP_MODE
          if (wrq->u.mode == IW_MODE_MASTER)
            {
              syslog(LOG_INFO, "nrf7002: SIOCSIWMODE -> AP mode\n");
              ret = nrf7002_ap_start(priv);
            }
          else
#endif
            {
              /* STA mode — always the default */

              syslog(LOG_INFO, "nrf7002: SIOCSIWMODE -> STA mode\n");
              ret = OK;
            }
        }
        break;

      default:
        break;
    }

  return ret;
}

#endif /* CONFIG_NETDEV_IOCTL */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_netdev_register
 *
 * Description:
 *   Configure and register the NuttX net_driver_s for the nRF7002.
 *
 * Returned Value:
 *   OK on success; negated errno on failure.
 *
 ****************************************************************************/

int nrf7002_netdev_register(FAR struct nrf7002_priv *priv)
{
  FAR struct net_driver_s *dev = &priv->netdev;

  /* Populate net_driver_s */

  dev->d_private = priv;

  /* MAC address: use the OTP MAC read from the nRF7002 chip (set by
   * nrf7002_initialize before registering the netdev).  Fall back to a
   * locally-administered placeholder if OTP read failed (all zeros).
   */

  if (priv->mac_addr[0] | priv->mac_addr[1] | priv->mac_addr[2] |
      priv->mac_addr[3] | priv->mac_addr[4] | priv->mac_addr[5])
    {
      memcpy(dev->d_mac.ether.ether_addr_octet, priv->mac_addr,
             NRF7002_MAC_ADDR_LEN);
    }
  else
    {
      /* OTP MAC not available: use locally-administered placeholder */

      dev->d_mac.ether.ether_addr_octet[0] = 0x02;
      dev->d_mac.ether.ether_addr_octet[1] = 0x00;
      dev->d_mac.ether.ether_addr_octet[2] = 0x00;
      dev->d_mac.ether.ether_addr_octet[3] = 0x7a;  /* '7' */
      dev->d_mac.ether.ether_addr_octet[4] = 0x00;
      dev->d_mac.ether.ether_addr_octet[5] = 0x02;  /* '2' → "nrf7002" */
    }

  /* Pre-allocate the flat TX packet buffer.
   * devif_poll uses flat-buffer mode when dev->d_buf is non-NULL;
   * without this it falls into IOB mode which our TX path cannot handle.
   */

  priv->pktbuf = (FAR uint8_t *)g_nrf7002_pktbuf;
  dev->d_buf   = priv->pktbuf;

  /* MTU for 802.11 data frames */

  dev->d_pktsize = CONFIG_NET_ETH_PKTSIZE;

  /* Ops */

  dev->d_ifup    = nrf7002_ifup;
  dev->d_ifdown  = nrf7002_ifdown;
  dev->d_txavail = nrf7002_txnotify; /* Phase 3: TX notification callback */
#ifdef CONFIG_NETDEV_IOCTL
  dev->d_ioctl   = nrf7002_ioctl;
#endif

  /* Register with the network layer as a WLAN device */

  return netdev_register(dev, NET_LL_IEEE80211);
}
